---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Parameter..::..AsValueString Method
Parameter Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AsValueString()()()() | Get the parameter value as a string with units. |
|  | AsValueString(FormatOptions) | Get the parameter value as a string with units. |

# See Also

Parameter Class

Parameter Members

Autodesk.Revit.DB Namespace